{
  "Sheet1": [
    {
      "display": 1,
      "id": "lin2022geometric",
      "year": 2022,
      "month": 4,
      "type": "C",
      "citelink": null,
      "cite": null,
      "title": "Geometric and topological inference for deep representations of complex networks",
      "authors": "Baihan Lin",
      "venue": "WWW 2022",
      "image": "lin2022geometric.png",
      "arxiv": "https://arxiv.org/abs/2203.05488",
      "bibtex": "lin2022geometric.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": null,
      "code": null,
      "video": null,
      "demo": null,
      "abstract": "Understanding the deep representations of complex networks is an important step of building interpretable and trustworthy machine learning applications in the age of internet. Global surrogate models that approximate the predictions of a black box model (e.g. an artificial or biological neural net) are usually used to provide valuable theoretical insights for the model interpretability. In order to evaluate how well a surrogate model can account for the representation in another model, we need to develop inference methods for model comparison. Previous studies have compared models and brains in terms of their representational geometries (characterized by the matrix of distances between representations of the input patterns in a model layer or cortical area). In this study, we propose to explore these summary statistical descriptions of representations in models and brains as part of a broader class of statistics that emphasize the topology as well as the geometry of representations. The topological summary statistics build on topological data analysis (TDA) and other graph-based methods. We evaluate these statistics in terms of the sensitivity and specificity that they afford when used for model selection, with the goal to relate different neural network models to each other and to make inferences about the computational mechanism that might best account for a black box representation. These new methods enable brain and computer scientists to visualize the dynamic representational transformations learned by brains and models, and to perform model-comparative statistical inference.",
      "with": null,
      "areas": "ML-GT-SB-NS"
    },
    {
      "display": 1,
      "id": "lin2021single",
      "year": null,
      "month": 0,
      "type": "M",
      "citelink": null,
      "cite": null,
      "title": "Single-cell topological simplicial analysis reveals higher-order cellular complexity",
      "authors": "Baihan Lin",
      "venue": "under review",
      "image": "lin2021single.png",
      "arxiv": null,
      "bibtex": null,
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": null,
      "code": "https://github.com/doerlbh/scTSA",
      "video": null,
      "demo": null,
      "abstract": "The absence of a conventional association between the cell-cell cohabitation and its emergent dynamics into cliques during development has hindered our understanding of how cell populations proliferate, differentiate, and compete, i.e. the cell ecology. With the recent advancement of the single-cell RNA-sequencing (RNA-seq), we can potentially describe such a link by constructing network graphs that characterize the similarity of the gene expression profiles of the cell-specific transcriptional programs, and analyzing these graphs systematically using the summary statistics informed by the algebraic topology. We propose the single-cell topological simplicial analysis (scTSA). Applying this approach to the single-cell gene expression profiles from local networks of cells in different developmental stages with different outcomes reveals a previously unseen topology of cellular ecology. These networks contain an abundance of cliques of single-cell profiles bound into cavities that guide the emergence of more complicated habitation forms. We visualize these ecological patterns with topological simplicial architectures of these networks, compared with the null models. Benchmarked on the single-cell RNA-seq data of zebrafish embryogenesis spanning 38,731 cells, 25 cell types and 12 time steps, our approach highlights the gastrulation as the most critical stage, consistent with consensus in developmental biology. As a nonlinear, model-independent, and unsupervised framework, our approach can also be applied to tracing multi-scale cell lineage, identifying critical stages, or creating pseudo-time series.",
      "with": "self-rabadan",
      "areas": "ML-GT-SB"
    },
    {
      "display": 1,
      "id": "lin2021topological",
      "year": null,
      "month": 0,
      "type": "M",
      "citelink": null,
      "cite": null,
      "title": "Topological Data Analysis in Time Series: Temporal Filtration and Application to Single-Cell Genomics",
      "authors": "Baihan Lin",
      "venue": "under review",
      "image": "lin2021topological.png",
      "arxiv": null,
      "bibtex": null,
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": null,
      "code": "https://github.com/doerlbh/scTSA",
      "video": null,
      "demo": null,
      "abstract": "The lack of a formal link between cell-cell cohabitation and its emergent dynamics into cliques during development has hampered our understanding of how cell populations proliferate, differentiate, and compete, i.e. the cell ecology. With the advancement of single-cell RNA-sequencing (RNA-seq), we have now come closer to describing such a link by taking cell-specific transcriptional programs into account, constructing graphs of a network that reflect the similarity of gene expression, and analyzing these graphs using algebraic topology. We propose the single-cell topological simplicial analysis (scTSA). Applying this approach to single-cell gene expression profiles from local networks of cells in different developmental stages with different outcomes reveals a previously unseen topology of cellular ecology. These networks contain an abundance of cliques of single-cell profiles bound into cavities that guide the emergence of more complicated habitation forms. We visualize these ecological patterns with topological simplicial architectures of these networks, compared with null models. Benchmarked on scRNA-seq of embryogenesis over 25 cell types and 12 time steps, our approach highlights the gastrulation as the most critical stage, consistent with consensus in developmental biology. As a nonlinear, model-independent, and unsupervised framework, our approach can be applied to tracing multi-scale cell lineage and identifying critical stages.",
      "with": "self-rabadan",
      "areas": "ML-GT-SB"
    },
    {
      "display": 1,
      "id": "lin2021epidemic",
      "year": null,
      "month": 0,
      "type": "M",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=17134834417595315956",
      "cite": 1,
      "title": "Optimal epidemic control as a contextual combinatorial bandit with budget",
      "authors": "Baihan Lin, Djallel Bouneffouf",
      "venue": "under review",
      "image": "lin2021epidemic.png",
      "arxiv": "https://arxiv.org/abs/2106.15808",
      "bibtex": "lin2021epidemic.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": null,
      "code": "https://github.com/doerlbh/BanditZoo",
      "video": null,
      "demo": null,
      "abstract": "In light of the COVID-19 pandemic, it is an open challenge and critical practical problem to find a optimal way to dynamically prescribe the best policies that balance both the governmental resources and epidemic control in different countries and regions. To solve this multi-dimensional tradeoff of exploitation and exploration, we formulate this technical challenge as a contextual combinatorial bandit problem that jointly optimizes a multi-criteria reward function. Given the historical daily cases in a region and the past intervention plans in place, the agent should generate useful intervention plans that policy makers can implement in real time to minimizing both the number of daily COVID-19 cases and the stringency of the recommended interventions. We prove this concept with simulations of multiple realistic policy making scenarios.",
      "with": "ibm",
      "areas": "ML-TM"
    },
    {
      "display": 1,
      "id": "lin2020predicting",
      "year": null,
      "month": 0,
      "type": "M",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=6402904878450562287",
      "cite": 1,
      "title": "Predicting human decision making in psychological tasks with recurrent neural networks",
      "authors": "Baihan Lin, Djallel Bouneffouf, Guillermo Cecchi",
      "venue": "under review",
      "image": "lin2020predicting.png",
      "arxiv": "https://arxiv.org/abs/2010.11413",
      "bibtex": "lin2020predicting.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": null,
      "code": "https://github.com/doerlbh/HumanLSTM",
      "video": null,
      "demo": null,
      "abstract": "Unlike traditional time series, the action sequences of human decision making usually involve many cognitive processes such as beliefs, desires, intentions and theory of mind, i.e. what others are thinking. This makes predicting human decision making challenging to be treated agnostically to the underlying psychological mechanisms. We propose to use a recurrent neural network architecture based on long short-term memory networks (LSTM) to predict the time series of the actions taken by the human subjects at each step of their decision making, the first application of such methods in this research domain. In this study, we collate the human data from 8 published literature of the Iterated Prisoner's Dilemma comprising 168,386 individual decisions and postprocess them into 8,257 behavioral trajectories of 9 actions each for both players. Similarly, we collate 617 trajectories of 95 actions from 10 different published studies of Iowa Gambling Task experiments with healthy human subjects. We train our prediction networks on the behavioral data from these published psychological experiments of human decision making, and demonstrate a clear advantage over the state-of-the-art methods in predicting human decision making trajectories in both single-agent scenarios such as the Iowa Gambling Task and multi-agent scenarios such as the Iterated Prisoner's Dilemma. In the prediction, we observe that the weights of the top performers tends to have a wider distribution, and a bigger bias in the LSTM networks, which suggests possible interpretations for the distribution of strategies adopted by each group.",
      "with": "ibm",
      "areas": "ML-NS"
    },
    {
      "display": 1,
      "id": "lin2020semi",
      "year": 2020,
      "month": 11,
      "type": "C",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=7368683227693107655",
      "cite": 11,
      "title": "Online semi-supervised learning in contextual bandits with episodic reward",
      "authors": "Baihan Lin",
      "venue": "AJCAI 2020",
      "image": "lin2020semi.png",
      "arxiv": "https://arxiv.org/abs/2009.08457",
      "bibtex": "lin2020semi.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": "AJCAI_BerlinUCB_slides.pdf",
      "code": "https://github.com/doerlbh/BerlinUCB",
      "video": "https://youtu.be/PsVHObTXtCw",
      "demo": null,
      "abstract": "We considered a novel practical problem of online learning with episodically revealed rewards, motivated by several real-world applications, where the contexts are nonstationary over different episodes and the reward feedbacks are not always available to the decision making agents. For this online semi-supervised learning setting, we introduced Background Episodic Reward LinUCB (BerlinUCB), a solution that easily incorporates clustering as a self-supervision module to provide useful side information when rewards are not observed. Our experiments on a variety of datasets, both in stationary and nonstationary environments of six different scenarios, demonstrated clear advantages of the proposed approach over the standard contextual bandit. Lastly, we introduced a relevant real-life example where this problem setting is especially useful.",
      "with": "self",
      "areas": "ML"
    },
    {
      "display": 1,
      "id": "lin2021speaker",
      "year": 2021,
      "month": 11,
      "type": "C",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=17042737051045836852",
      "cite": 5,
      "title": "Speaker diarization as a fully online bandit learning problem in MiniVox",
      "authors": "Baihan Lin, Xinxin Zhang",
      "venue": "ACML 2021",
      "image": "lin2021speaker.png",
      "arxiv": "https://arxiv.org/abs/2006.04376",
      "bibtex": "lin2021speaker.txt",
      "linkname": null,
      "link": "https://youtu.be/vETywv5aUkU",
      "poster": null,
      "pdf": null,
      "slides": "ACML_MiniVox_slides.pdf",
      "code": "https://github.com/doerlbh/MiniVox",
      "video": null,
      "demo": "https://www.baihan.nyc/viz/VoiceID/",
      "abstract": "We propose a novel machine learning framework to conduct real-time multi-speaker diarization and recognition without prior registration and pretraining in a fully online learning setting. Our contributions are two-fold. First, we propose a new benchmark to evaluate the rarely studied fully online speaker diarization problem. We build upon existing datasets of real world utterances to automatically curate MiniVox, an experimental environment which generates infinite configurations of continuous multi-speaker speech stream. Second, we consider the practical problem of online learning with episodically revealed rewards and introduce a solution based on semi-supervised and self-supervised learning methods. Additionally, we provide a workable web-based recognition system which interactively handles the cold start problem of new user's addition by transferring representations of old arms to new ones with an extendable contextual bandit. We demonstrate that our proposed method obtains robust performance in the online MiniVox framework given either cepstrum-based representations or deep neural network embeddings.",
      "with": "self",
      "areas": "SP-ML-HCI"
    },
    {
      "display": 1,
      "id": "lin2018adgtic",
      "year": null,
      "month": 0,
      "type": "M",
      "citelink": null,
      "cite": null,
      "title": "Adaptive geo-topological independence criterion  ",
      "authors": "Baihan Lin, Nikolaus Kriegeskorte",
      "venue": "under review",
      "image": "lin2018adgtic.png",
      "arxiv": "https://arxiv.org/abs/1810.02923",
      "bibtex": "lin2018adgtic.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": null,
      "code": "https://github.com/doerlbh/AGTIC",
      "video": null,
      "demo": null,
      "abstract": "Testing two potentially multivariate variables for statistical dependence on the basis finite samples is a fundamental statistical challenge. Here we explore a family of tests that adapt to the complexity of the relationship between the variables, promising robust power across scenarios. Building on the distance correlation, we introduce a family of adaptive independence criteria based on nonlinear monotonic transformations of distances. We show that these criteria, like the distance correlation and RKHS-based criteria, provide dependence indicators. We propose a class of adaptive (multi-threshold) test statistics, which form the basis for permutation tests. These tests empirically outperform some of the established tests in average and worst-case statistical sensitivity across a range of univariate and multivariate relationships, offer useful insights to the data and may deserve further exploration.",
      "with": "kriegeskorte",
      "areas": "ML-GT"
    },
    {
      "display": 1,
      "id": "lin2020online",
      "year": null,
      "month": 0,
      "type": "M",
      "citelink": "https://scholar.google.com/scholar?cites=2963048913352425029&as_sdt=5,33&sciodt=0,33&hl=en",
      "cite": 24,
      "title": "Online learning in iterated prisoner's dilemma to mimic human behavior",
      "authors": "Baihan Lin, Djallel Bouneffouf, Guillermo Cecchi",
      "venue": "under review",
      "image": "lin2020online.png",
      "arxiv": "https://arxiv.org/abs/2006.06580",
      "bibtex": "lin2020online.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": null,
      "code": "https://github.com/doerlbh/dilemmaRL",
      "video": null,
      "demo": null,
      "abstract": "Prisoner's Dilemma mainly treat the choice to cooperate or defect as an atomic action. We propose to study online learning algorithm behavior in the Iterated Prisoner's Dilemma (IPD) game, where we explored the full spectrum of reinforcement learning agents: multi-armed bandits, contextual bandits and reinforcement learning. We have evaluate them based on a tournament of iterated prisoner's dilemma where multiple agents can compete in a sequential fashion. This allows us to analyze the dynamics of policies learned by multiple self-interested independent reward-driven agents, and also allows us study the capacity of these algorithms to fit the human behaviors. Results suggest that considering the current situation to make decision is the worst in this kind of social dilemma game. Multiples discoveries on online learning behaviors and clinical validations are stated.",
      "with": "ibm",
      "areas": "ML-TM-NS"
    },
    {
      "display": 1,
      "id": "lin2022regularity",
      "year": 2022,
      "month": 1,
      "type": "J",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=5039303543837654683",
      "cite": 1,
      "title": "Regularity normalization: neuroscience-inspired unsupervised attention across neural network layers",
      "authors": "Baihan Lin",
      "venue": "Entropy",
      "image": "lin2022regularity.png",
      "arxiv": "https://arxiv.org/abs/1902.10658",
      "bibtex": "lin2022regularity.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": null,
      "code": "https://github.com/doerlbh/UnsupervisedAttentionMechanism",
      "video": null,
      "demo": null,
      "abstract": "Inspired by the adaptation phenomenon of neuronal firing, we propose the regularity normalization (RN) as an unsupervised attention mechanism (UAM) which computes the statistical regularity in the implicit space of neural networks under the Minimum Description Length (MDL) principle. Treating the neural network optimization process as a partially observable model selection problem, the regularity normalization constrains the implicit space by a normalization factor, the universal code length. We compute this universal code incrementally across neural network layers and demonstrate the flexibility to include data priors such as top-down attention and other oracle information. Empirically, our approach outperforms existing normalization methods in tackling limited, imbalanced and non-stationary input distribution in image classification, classic control, procedurally-generated reinforcement learning, generative modeling, handwriting generation and question answering tasks with various neural network architectures. Lastly, the unsupervised attention mechanisms is a useful probing tool for neural networks by tracking the dependency and critical learning stages across layers and recurrent time steps of deep networks.",
      "with": "self-qian",
      "areas": "ML-IT-CV"
    },
    {
      "display": 1,
      "id": "berger2020follow",
      "year": null,
      "month": 0,
      "type": "M",
      "citelink": null,
      "cite": null,
      "title": "Follow your nose: extended arm reach after Pinocchio illusion in virtual reality",
      "authors": "Christopher Berger, Baihan Lin, Bigna Lenggenhager, Jaron Lanier, Mar Gonzalez-Franco",
      "venue": "under review",
      "image": "berger2020follow.gif",
      "arxiv": null,
      "bibtex": null,
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": null,
      "code": null,
      "video": null,
      "demo": null,
      "abstract": "In this study, we recreated the Pinocchio Illusion—a bodily illusion whereby the perceived length of the own nose is extended—in Virtual Reality. Participants (n = 38) self-administered tapping on the tip of the nose of their embodied virtual avatar (using a hand-held controller) while the nose of the avatar slowly grew with each tap. The stimulating arm and the nose of the virtual avatar were attached such that while the nose grew the arm of the avatar also grew by 50% after it was fully extended. This produced an extension of the perceived reach of their arm, and an outward drift in the participants’ real arm. A positive correlation between the extent of the outward drift of the participants’ arm and the perceived reachability of distal objects was observed. These results were also found without tactile stimulation on the participants nose, but not for control conditions in which the visuomotor synchrony or body schema were violated. These findings open new avenues for hand grasp interactions with virtual objects out of arm’s-reach in immersive setups, and are discussed in the context of theories on body schema, touch perception, and ownership.",
      "with": "microsoft",
      "areas": "NS-HCI"
    },
    {
      "display": 1,
      "id": "lin2020voice",
      "year": 2020,
      "month": 10,
      "type": "C",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=652131822995068130",
      "cite": 5,
      "title": "VoiceID on the fly: a speaker recognition system that learns from scratch",
      "authors": "Baihan Lin, Xinxin Zhang",
      "venue": "INTERSPEECH 2020",
      "image": "lin2020voice.gif",
      "arxiv": "https://hal.archives-ouvertes.fr/hal-02939812/document",
      "bibtex": "lin2020voice.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": "INTERSPEECH_VoiceID_slides",
      "code": "https://github.com/doerlbh/MiniVox",
      "video": "https://youtu.be/QqLnFS5_rCs",
      "demo": "https://www.baihan.nyc/viz/VoiceID/",
      "abstract": "We proposed a novel AI framework to conduct real-time multi-speaker recognition without any prior registration or pretraining by learning the speaker identification on the fly. We considered the practical problem of online learning with episodically revealed rewards and introduced a solution based on semi-supervised and self-supervised learning methods in a web-based application at https://www.baihan.nyc/viz/VoiceID/",
      "with": "self",
      "areas": "SP-ML-HCI"
    },
    {
      "display": 1,
      "id": "lin2020unified",
      "year": 2020,
      "month": 8,
      "type": "C",
      "citelink": "https://scholar.google.com/scholar?cites=14531173915464002813&as_sdt=5,33&sciodt=0,33&hl=en",
      "cite": 23,
      "title": "Unified models of human behavioral agents in bandits, contextual bandits and RL",
      "authors": "Baihan Lin, Guillermo Cecchi, Djallel Bouneffouf, Jenna Reinen, Irina Rish",
      "venue": "IJCAI 2020 Workshop on Human Brain and Artificial Intelligence (HBAI)",
      "image": "lin2020unified.png",
      "arxiv": "https://arxiv.org/abs/2005.04544",
      "bibtex": "lin2020unified.txt",
      "linkname": "interview",
      "link": "https://youtu.be/e8IT1S0HXfY?t=3380",
      "poster": null,
      "pdf": null,
      "slides": "KDD_MentalRL_slides.pdf",
      "code": "https://github.com/doerlbh/mentalRL",
      "video": "https://youtu.be/CpOK5yXsaDE",
      "demo": null,
      "abstract": "Artificial behavioral agents are often evaluated based on their consistent behaviors and performance to take sequential actions in an environment to maximize some notion of cumulative reward. However, human decision making in real life usually involves different strategies and behavioral trajectories that lead to the same empirical outcome. Motivated by clinical literature of a wide range of neurological and psychiatric disorders, we propose here a more general and flexible parametric framework for sequential decision making that involves a two-stream reward processing mechanism. We demonstrated that this framework is flexible and unified enough to incorporate a family of problems spanning Multi-armed bandits (MAB), contextual bandits (CB) and reinforcement learning (RL), which decompose the sequential decision making process in different levels. Inspired by the known reward processing abnormalities of many mental disorders, our clinically-inspired agents demonstrated interesting behavioral trajectories and comparable performance on simulated tasks with particular reward distributions, a real-world dataset capturing human decision-making in gambling tasks, and the PacMan game across different reward stationarities in a lifelong learning setting.",
      "with": "ibm",
      "areas": "ML-TM-NS"
    },
    {
      "display": 1,
      "id": "lin2020keep",
      "year": 2020,
      "month": 7,
      "type": "C",
      "citelink": null,
      "cite": null,
      "title": "Keep it real: a window to real reality in virtual reality",
      "authors": "Baihan Lin",
      "venue": "IJCAI 2020",
      "image": "lin2020keep.gif",
      "arxiv": "https://arxiv.org/abs/2004.10313",
      "bibtex": "lin2020keep.txt",
      "linkname": null,
      "link": null,
      "poster": "IJCAI_V2R_poster.pdf",
      "pdf": null,
      "slides": "IJCAI_V2R_slides.pdf",
      "code": "https://github.com/doerlbh/V2R",
      "video": "https://youtu.be/mEiaFmEq_yQ",
      "demo": null,
      "abstract": "This paper proposed a new interaction paradigm in the virtual reality (VR) environments, which consists of a virtual mirror or window projected onto a virtual surface, representing the correct perspective geometry of a mirror or window reflecting the real world. This technique can be applied to various videos, live streaming apps, augmented and virtual reality settings to provide an interactive and immersive user experience. To support such a perspective-accurate representation, we implemented computer vision algorithms for feature detection and correspondence matching. To constrain the solutions, we incorporated an automatically tuning scaling factor upon the homography transform matrix such that each image frame follows a smooth transition with the user in sight. The system is a real-time rendering framework where users can engage their real-life presence with the virtual space.",
      "with": "self",
      "areas": "CV-HCI"
    },
    {
      "display": 1,
      "id": "lin2020astory",
      "year": 2020,
      "month": 5,
      "type": "C",
      "citelink": "https://scholar.google.com/scholar?cites=15249901474182975905&as_sdt=5,33&sciodt=0,33&hl=en",
      "cite": 22,
      "title": "A story of two streams: reinforcement learning models from human behavior and neuropsychiatry",
      "authors": "Baihan Lin, Guillermo Cecchi, Djallel Bouneffouf, Jenna Reinen, Irina Rish",
      "venue": "AAMAS 2020",
      "image": "lin2020astory.gif",
      "arxiv": "https://arxiv.org/abs/1906.11286",
      "bibtex": "lin2020astory.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": "AAMAS_MentalRL_slides.pdf",
      "code": "https://github.com/doerlbh/mentalRL",
      "video": "https://www.youtube.com/watch?v=CQBdQz1bmls",
      "demo": null,
      "abstract": "Drawing an inspiration from behavioral studies of human decision making, we propose here a more general and flexible parametric framework for reinforcement learning that extends standard Q-learning to a two-stream model for processing positive and negative rewards, and allows to incorporate a wide range of reward-processing biases -- an important component of human decision making which can help us better understand a wide spectrum of multi-agent interactions in complex real-world socioeconomic systems, as well as various neuropsychiatric conditions associated with disruptions in normal reward processing. From the computational perspective, we observe that the proposed Split-QL model and its clinically inspired variants consistently outperform standard Q-Learning and SARSA methods, as well as recently proposed Double Q-Learning approaches, on simulated tasks with particular reward distributions, a real-world dataset capturing human decision-making in gambling tasks, and the Pac-Man game in a lifelong learning setting across different reward stationarities.",
      "with": "ibm",
      "areas": "ML-TM-NS"
    },
    {
      "display": 1,
      "id": "lin2019reinforce",
      "year": 2019,
      "month": 12,
      "type": "E",
      "citelink": null,
      "cite": null,
      "title": "Reinforcement learning models of human behavior: reward processing in mental disorders",
      "authors": "Baihan Lin, Guillermo Cecchi, Djallel Bouneffouf, Jenna Reinen, Irina Rish",
      "venue": "NeurIPS 2019 Workshop on Biological & Artificial RL (BARL)",
      "image": "lin2019reinforce.png",
      "arxiv": "https://arxiv.org/abs/1906.11286",
      "bibtex": "lin2019reinforce.txt",
      "linkname": null,
      "link": null,
      "poster": "NIPS_HumanQL_poster.pdf",
      "pdf": null,
      "slides": null,
      "code": "https://github.com/doerlbh/mentalRL",
      "video": "https://www.youtube.com/watch?v=ZFCMjPiSxIQ",
      "demo": null,
      "abstract": "Drawing an inspiration from behavioral studies of human decision making, we propose here a more general and flexible parametric framework for reinforcement learning that extends standard Q-learning to a two-stream model for processing positive and negative rewards, and allows to incorporate a wide range of reward-processing biases -- an important component of human decision making which can help us better understand a wide spectrum of multi-agent interactions in complex real-world socioeconomic systems, as well as various neuropsychiatric conditions associated with disruptions in normal reward processing. From the computational perspective, we observe that the proposed Split-QL model and its clinically inspired variants consistently outperform standard Q-Learning and SARSA methods, as well as recently proposed Double Q-Learning approaches, on simulated tasks with particular reward distributions, a real-world dataset capturing human decision-making in gambling tasks, and the Pac-Man game in a lifelong learning setting across different reward stationarities. Moreover, from the behavioral modeling perspective, our parametric framework can be viewed as a first step towards a unifying computational model capturing reward processing abnormalities across multiple mental conditions and user preferences in long-term recommendation systems.",
      "with": "ibm",
      "areas": "ML-TM-NS"
    },
    {
      "display": 1,
      "id": "lin2019what",
      "year": 2019,
      "month": 12,
      "type": "E",
      "citelink": null,
      "cite": null,
      "title": "What about higher-order cellular complexity? An inquiry with topological simplicial analysis",
      "authors": "Baihan Lin, Raul Rabadan, Nikolaus Kriegeskorte",
      "venue": "NeurIPS 2019 Workshop on Learning Meaningful Representations of Life (LMRL)",
      "image": "lin2019what.png",
      "arxiv": null,
      "bibtex": "lin2019what.txt",
      "linkname": null,
      "link": null,
      "poster": "NIPS_scTSA_poster.pdf",
      "pdf": null,
      "slides": null,
      "code": "https://github.com/doerlbh/scTSA",
      "video": null,
      "demo": null,
      "abstract": "The lack of a formal link between cell-cell cohabitation and its emergent dynamics into cliques during development has hampered our understanding of how cell populations proliferate, differentiate, and compete, i.e. the cell ecology. With the advancement of single-cell RNA-sequencing (RNA-seq), we have now come closer to describing such a link by taking cell-specific transcriptional programs into account, constructing graphs of a network that reflect the similarity of gene expression, and analyzing these graphs using algebraic topology. We proposed single-cell topological simplicial analysis (scTSA). Applying this approach to single-cell gene expression profiles from local networks of cells in different developmental stages with different outcomes revealed a previously unseen topology of cellular ecology. These networks contain an abundance of cliques of single-cell profiles bound into cavities that guide the emergence of more complicated habitation forms. We visualize these ecological patterns with topological simplicial architectures of these networks, compared with the null models. Benchmarked on single-cell RNA-seq of zebrafish embryogenesis over 25 cell types and 12 time steps, our approach highlights the gastrulation as the most critical stage, consistent with consensus in developmental biology. As a nonlinear, model-independent, and unsupervised framework, our approach can also be applied to tracing multi-scale cell lineage, identifying critical stages, or creating pseudo-time series.",
      "with": "self-kriegeskorte-rabadan",
      "areas": "ML-GT-SB"
    },
    {
      "display": 1,
      "id": "andelin2020influence",
      "year": 2020,
      "month": 3,
      "type": "J",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=6845542143431738274",
      "cite": 4,
      "title": "Influence of ocular dominance columns and patchy callosal connections on binocularity in lateral striate cortex: Long Evans versus albino rats",
      "authors": "Adrian Andelin, Zane Doyle, Robyn Laing, Josef Turecek, Baihan Lin, Jaime Olavarria",
      "venue": "Journal of Comparative Neurology",
      "image": "andelin2020influence.png",
      "arxiv": null,
      "bibtex": "andelin2020influence.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": "andelin2020influence.pdf",
      "slides": null,
      "code": "https://github.com/doerlbh/OLab_IntanEphys",
      "video": null,
      "demo": null,
      "abstract": "In albino rats, it has been reported that lateral striate cortex (V1) is highly binocular, and that input from the ipsilateral eye to this region comes through the callosum. In contrast, in Long Evans rats, this region is nearly exclusively dominated by the contralateral eye even though it is richly innervated by the callosum (Laing, Turecek, Takahata, & Olavarria, 2015). We hypothesized that the inability of callosal connections to relay ipsilateral eye input to lateral V1 in Long Evans rats is a consequence of the existence of ocular dominance columns (ODCs), and of callosal patches in register with ipsilateral ODCs in the binocular region of V1 (Laing et al., 2015). We therefore predicted that in albino rats input from both eyes intermix in the binocular region, without segregating into ODCs, and that callosal connections are not patchy. Confirming our predictions, we found that inputs from both eyes, studied with the transneuronal tracer WGA-HRP, are intermixed in the binocular zone of albinos, without segregating into ODCs. Similarly, we found that callosal connections in albino rats are not patchy but instead are distributed homogeneously throughout the callosal region in V1. We propose that these changes allow the transcallosal passage of ipsilateral eye input to lateral striate cortex, increasing its binocularity. Thus, the binocular region in V1 of albino rats includes lateral striate cortex, being therefore about 25% larger in area than the binocular region in Long Evans rats. Our findings provide insight on the role of callosal connections in generating binocular cells.",
      "with": "olavarria",
      "areas": "NS-CV"
    },
    {
      "display": 1,
      "id": "lin2019modeling",
      "year": 2019,
      "month": 10,
      "type": "E",
      "citelink": null,
      "cite": null,
      "title": "Modeling neurological and psychiatric disorders with reward biased reinforcement learning models",
      "authors": "Baihan Lin",
      "venue": "TIPS 2019",
      "image": "lin2019modeling.png",
      "arxiv": null,
      "bibtex": "lin2019modeling.txt",
      "linkname": null,
      "link": "https://home.mcleanhospital.org/tips",
      "poster": null,
      "pdf": null,
      "slides": null,
      "code": "https://github.com/doerlbh/mentalRL",
      "video": null,
      "demo": null,
      "abstract": "Drawing an inspiration from behavioral studies of human decision making, we propose here a general parametric framework for a reinforcement learning problem, which extends the standard Q-learning approach to incorporate a two-stream framework of reward processing with biases biologically associated with several neurological and psychiatric conditions, including Parkinson's and Alzheimer's diseases, attention-deficit/hyperactivity disorder (ADHD), addiction, and chronic pain. For AI community, the development of agents that react differently to different types of rewards can enable us to understand a wide spectrum of multi-agent interactions in complex real-world socioeconomic systems. Empirically, the proposed model outperforms Q-Learning and Double Q-Learning in artificial scenarios with certain reward distributions and real-world human decision making gambling tasks. Moreover, from the behavioral modeling perspective, our parametric framework can be viewed as a first step towards a unifying computational model capturing reward processing abnormalities across multiple mental conditions and user preferences in long-term recommendation systems.",
      "with": "ibm",
      "areas": "ML-TM-NS"
    },
    {
      "display": 1,
      "id": "lin2019visualize",
      "year": 2019,
      "month": 9,
      "type": "C",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=17304195652212051367",
      "cite": 1,
      "title": "Visualizing representational dynamics with multidimensional scaling alignment",
      "authors": "Baihan Lin, Marieke Mur, Tim Kietzmann, Nikolaus Kriegeskorte",
      "venue": "CCN 2019",
      "image": "lin2019visualize.gif",
      "arxiv": "https://arxiv.org/abs/1906.09264",
      "bibtex": "lin2019visualize.txt",
      "linkname": null,
      "link": "https://ccneuro.org/2019/Papers/ViewPapers.asp?PaperNum=1424",
      "poster": "CCN_MDA_poster.pdf",
      "pdf": null,
      "slides": null,
      "code": "https://github.com/rsagroup/pyrsa",
      "video": null,
      "demo": null,
      "abstract": "Representational similarity analysis (RSA) has been shown to be an effective framework to characterize brain-activity profiles and deep neural network activations as representational geometry by computing the pairwise distances of the response patterns as a representational dissimilarity matrix (RDM). However, how to properly analyze and visualize the representational geometry as dynamics over the time course from stimulus onset to offset is not well understood. In this work, we formulated the pipeline to understand representational dynamics with RDM movies and Procrustes-aligned Multidimensional Scaling (pMDS), and applied it to neural recording of monkey IT cortex. Our results suggest that the the multidimensional scaling alignment can genuinely capture the dynamics of the category-specific representation spaces with multiple visualization possibilities, and that object categorization may be hierarchical, multi-staged, and oscillatory (or recurrent).",
      "with": "kriegeskorte",
      "areas": "NS-ML"
    },
    {
      "display": 1,
      "id": "lin2019cliques",
      "year": 2019,
      "month": 7,
      "type": "E",
      "citelink": null,
      "cite": null,
      "title": "Cliques of single-cell RNA-seq profiles reveal insights into cell ecology during development and differentiation",
      "authors": "Baihan Lin",
      "venue": "ISMB 2019",
      "image": "lin2019cliques.png",
      "arxiv": null,
      "bibtex": "lin2019cliques.txt",
      "linkname": null,
      "link": "https://www.iscb.org/cms_addon/conferences/ismbeccb2019/posters.php?track=BioVis%20COSI&session=A",
      "poster": "ISMB_scTSA_poster.pdf",
      "pdf": null,
      "slides": "ISMB_scTSA_slides.pdf",
      "code": "https://github.com/doerlbh/scTSA",
      "video": null,
      "demo": null,
      "abstract": "The lack of a formal link between cell-cell cohabitation and its emergent dynamics into cliques during development has hampered our understanding of how cell populations proliferate, differentiate, and compete, i.e. the cell ecology. With the advancement of single-cell RNA-sequencing (RNA-seq), we have now come closer to describing such a link by taking cell-specific transcriptional programs into account, constructing graphs of a network that reflect the similarity of gene expression, and analyzing these graphs using algebraic topology. We proposed single-cell topological simplicial analysis (scTSA). Applying this approach to single-cell gene expression profiles from local networks of cells in different developmental stages with different outcomes revealed a previously unseen topology of cellular ecology. These networks contain an abundance of cliques of single-cell profiles bound into cavities that guide the emergence of more complicated habitation forms. We visualize these ecological patterns with topological simplicial architectures of these networks, compared with the null models. Benchmarked on single-cell RNA-seq of zebrafish embryogenesis over 25 cell types and 12 time steps, our approach highlights the gastrulation as the most critical stage, consistent with consensus in developmental biology. As a nonlinear, model-independent, and unsupervised framework, our approach can also be applied to tracing multi-scale cell lineage, identifying critical stages, or creating pseudo-time series.",
      "with": "self-rabadan",
      "areas": "ML-GT-SB"
    },
    {
      "display": 1,
      "id": "chen2019self",
      "year": 2019,
      "month": 6,
      "type": "J",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=1579408407249363150",
      "cite": 26,
      "title": "Self-assembling 2d arrays with de novo protein building blocks",
      "authors": "Zibo Chen, Matthew Johnson, Jiajun Chen, Matthew Bick, Scott Boyken, Baihan Lin, James DeYoreo, Justin Kollman, David Baker, and Frank DiMaio",
      "venue": "Journal of the American Chemical Society",
      "image": "chen2019self.png",
      "arxiv": null,
      "bibtex": "chen2019self.txt",
      "linkname": "JACS cover story",
      "link": "https://pubs.acs.org/toc/jacsat/141/22",
      "poster": null,
      "pdf": "chen2019self.pdf",
      "slides": null,
      "code": "https://github.com/doerlbh?&tab=repositories&q=baker",
      "video": null,
      "demo": null,
      "abstract": "Modular self-assembly of biomolecules in two dimensions (2D) is straightforward with DNA but has been difficult to realize with proteins, due to the lack of modular specificity similar to Watson–Crick base pairing. Here we describe a general approach to design 2D arrays using de novo designed pseudosymmetric protein building blocks. A homodimeric helical bundle was reconnected into a monomeric building block, and the surface was redesigned in Rosetta to enable self-assembly into a 2D array in the C12 layer symmetry group. Two out of ten designed arrays assembled to micrometer scale under negative stain electron microscopy, and displayed the designed lattice geometry with assembly size up to 100 nm under atomic force microscopy. The design of 2D arrays with pseudosymmetric building blocks is an important step toward the design of programmable protein self-assembly via pseudosymmetric patterning of orthogonal binding interfaces.",
      "with": "baker",
      "areas": "SB"
    },
    {
      "display": 1,
      "id": "lin2019split",
      "year": 2019,
      "month": 6,
      "type": "C",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=12406356167900221313",
      "cite": 13,
      "title": "Split Q learning: reinforcement learning with two-stream rewards",
      "authors": "Baihan Lin, Djallel Bouneffouf, Guillermo Cecchi",
      "venue": "IJCAI 2019",
      "image": "lin2019split.png",
      "arxiv": "https://arxiv.org/abs/1906.12350",
      "bibtex": "lin2019split.txt",
      "linkname": null,
      "link": null,
      "poster": "IJCAI_SQL_poster.pdf",
      "pdf": null,
      "slides": "IJCAI_SQL_slides.pdf",
      "code": "https://github.com/doerlbh/mentalRL",
      "video": null,
      "demo": null,
      "abstract": "Drawing an inspiration from behavioral studies of human decision making, we propose here a general parametric framework for a reinforcement learning problem, which extends the standard Q-learning approach to incorporate a two-stream framework of reward processing with biases biologically associated with several neurological and psychiatric conditions, including Parkinson's and Alzheimer's diseases, attention-deficit/hyperactivity disorder (ADHD), addiction, and chronic pain. For AI community, the development of agents that react differently to different types of rewards can enable us to understand a wide spectrum of multi-agent interactions in complex real-world socioeconomic systems. Moreover, from the behavioral modeling perspective, our parametric framework can be viewed as a first step towards a unifying computational model capturing reward processing abnormalities across multiple mental conditions and user preferences in long-term recommendation systems.",
      "with": "ibm",
      "areas": "ML-TM-NS"
    },
    {
      "display": 1,
      "id": "lin2019neural",
      "year": 2019,
      "month": 6,
      "type": "C",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=4167011196447633661",
      "cite": 2,
      "title": "Neural networks as model selection with incremental MDL normalization",
      "authors": "Baihan Lin",
      "venue": "IJCAI 2019 Workshop on Human Brain and Artificial Intelligence (HBAI)",
      "image": "lin2019neural.png",
      "arxiv": "https://arxiv.org/abs/1902.10658v7",
      "bibtex": "lin2019neural.txt",
      "linkname": null,
      "link": null,
      "poster": "IJCAI_RN_poster.pdf",
      "pdf": null,
      "slides": "IJCAI_RN_slides.pdf",
      "code": "https://github.com/doerlbh/UnsupervisedAttentionMechanism",
      "video": null,
      "demo": null,
      "abstract": "If we consider the neural network optimization process as a model selection problem, the implicit space can be constrained by the normalizing factor, the minimum description length of the optimal universal code. Inspired by the adaptation phenomenon of biological neuronal firing, we propose a class of reparameterization of the activation in the neural network that take into account the statistical regularity in the implicit space under the Minimum Description Length (MDL) principle. We introduce an incremental version of computing this universal code as normalized maximum likelihood and demonstrated its flexibility to include data prior such as top-down attention and other oracle information and its compatibility to be incorporated into batch normalization and layer normalization. The empirical results showed that the proposed method outperforms existing normalization methods in tackling the limited and imbalanced data from a non-stationary distribution benchmarked on computer vision and reinforcement learning tasks. As an unsupervised attention mechanism given input data, this biologically plausible normalization has the potential to deal with other complicated real-world scenarios as well as reinforcement learning setting where the rewards are sparse and non-uniform. Further research is proposed to discover these scenarios and explore the behaviors among different variants.",
      "with": "self-qian",
      "areas": "ML-IT-CV"
    },
    {
      "display": 1,
      "id": "lin2018contextual",
      "year": 2018,
      "month": 11,
      "type": "C",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=8304741524513322131,5001830694355642133,6884515163842516123",
      "cite": 37,
      "title": "Contextual bandit with adaptive feature extraction",
      "authors": "Baihan Lin, Guillermo Cecchi, Djallel Bouneffouf, Irina Rish",
      "venue": "IEEE ICDM 2018 Workshop on Data Science and Big Data Analytics (DSBDA)",
      "image": "lin2018adaptive.jpg",
      "arxiv": "https://arxiv.org/abs/1802.00981",
      "bibtex": "lin2018contextual.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": null,
      "slides": null,
      "code": "https://github.com/doerlbh/ABaCoDE",
      "video": null,
      "demo": null,
      "abstract": "We consider an online decision making setting known as contextual bandit problem, and propose an approach for improving contextual bandit performance by using an adap- tive feature extraction (representation learning) based on online clustering. Our approach starts with an off-line pre-training on unlabeled history of contexts (which can be exploited by our approach, but not by the standard contextual bandit), followed by an online selection and adaptation of encoders. Specifically, given an input sample (context), the proposed approach selects the most appropriate encoding function to extract a feature vector which becomes an input for a contextual bandit, and updates both the bandit and the encoding function based on the context and on the feedback (reward). Our experiments on a variety of datasets, and both in stationary and non-stationary environments of several kinds demonstrate clear advantages of the proposed adaptive representation learning over the standard contextual bandit based on \"raw\" input contexts.",
      "with": "ibm",
      "areas": "ML"
    },
    {
      "display": 1,
      "id": "bukkittu2017parkinson",
      "year": 2017,
      "month": 11,
      "type": "E",
      "citelink": null,
      "cite": null,
      "title": "Parkinson’s disease digital biomarker discovery with optimized transitions and inferred markov emissions",
      "authors": "Avinash Bukkittu, Baihan Lin, Trung Vu, Itsik Pe’er",
      "venue": "RECOMB/ISCB 2017 Conference on Regulatory & Systems Genomics",
      "image": "bukkittu2017parkinson.png",
      "arxiv": "https://arxiv.org/abs/1711.04078",
      "bibtex": "bukkittu2017parkinson.txt",
      "linkname": null,
      "link": null,
      "poster": "RSG_PDBiomarker_poster.pdf",
      "pdf": null,
      "slides": "bukkittu2017parkinson_slides.pdf",
      "code": "https://github.com/doerlbh/DREAM_PDBiomarker",
      "video": null,
      "demo": null,
      "abstract": "We search for digital biomarkers from Parkinson's Disease by observing approximate repetitive patterns matching hypothesized step and stride periodic cycles. These observations were modeled as a cycle of hidden states with randomness allowing deviation from a canonical pattern of transitions and emissions, under the hypothesis that the averaged features of hidden states would serve to informatively characterize classes of patients/controls. We propose a Hidden Semi-Markov Model (HSMM), a latent-state model, emitting 3D-acceleration vectors. Transitions and emissions are inferred from data. We fit separate models per unique device and training label. Hidden Markov Models (HMM) force geometric distributions of the duration spent at each state before transition to a new state. Instead, our HSMM allows us to specify the distribution of state duration. This modified version is more effective because we are interested more in each state's duration than the sequence of distinct states, allowing inclusion of these durations the feature vector.",
      "with": "peer",
      "areas": "ML-SB-TM"
    },
    {
      "display": 1,
      "id": "teng2017dynamic",
      "year": 2017,
      "month": 1,
      "type": "J",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=15337806914563497255",
      "cite": 125,
      "title": "Dynamic forecasting of Zika epidemics using Google Trends",
      "authors": "Yue Teng, Dehua Bi, Guigang Xie, Yuan Jin, Yong Huang, Baihan Lin, Xiaoping An, Dan Feng, Yigang Tong",
      "venue": "PLOS ONE",
      "image": "teng2017dynamic.png",
      "arxiv": null,
      "bibtex": "teng2017dynamic.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": "teng2017dynamic.pdf",
      "slides": null,
      "code": null,
      "video": null,
      "demo": null,
      "abstract": "We developed a dynamic forecasting model for Zika virus (ZIKV), based on real-time online search data from Google Trends (GTs). It was designed to provide Zika virus disease (ZVD) surveillance and detection for Health Departments, and predictive numbers of infection cases, which would allow them sufficient time to implement interventions. In this study, we found a strong correlation between Zika-related GTs and the cumulative numbers of reported cases (confirmed, suspected and total cases; p <0.001). Then, we used the correlation data from Zika-related online search in GTs and ZIKV epidemics between 12 February and 20 October 2016 to construct an autoregressive integrated moving average (ARIMA) model (0, 1, 3) for the dynamic estimation of ZIKV outbreaks. The forecasting results indicated that the predicted data by ARIMA model, which used the online search data as the external regressor to enhance the forecasting model and assist the historical epidemic data in improving the quality of the predictions, are quite similar to the actual data during ZIKV epidemic early November 2016. Integer-valued autoregression provides a useful base predictive model for ZVD cases. This is enhanced by the incorporation of GTs data, confirming the prognostic utility of search query based surveillance. This accessible and flexible dynamic forecast model could be used in the monitoring of ZVD to provide advanced warning of future ZIKV outbreaks.",
      "with": "teng",
      "areas": "ML-TM-AM"
    },
    {
      "display": 1,
      "id": "teng2017model",
      "year": 2017,
      "month": 5,
      "type": "J",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=8672568307184060174",
      "cite": 24,
      "title": "Model-informed risk assessment for Zika virus outbreaks in the Asia-Pacific regions",
      "authors": "Yue Teng, Dehua Bi, Guigang Xie, Yuan Jin, Yong Huang, Baihan Lin, Xiaoping An, Yigang Tong, Dan Feng",
      "venue": "Journal of Infection",
      "image": "teng2017model.png",
      "arxiv": null,
      "bibtex": "teng2017model.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": "teng2017model.pdf",
      "slides": null,
      "code": null,
      "video": null,
      "demo": null,
      "abstract": "Recently, Zika virus (ZIKV) has been recognized as a significant threat to global public health. The disease was present in large parts of the Americas, the Caribbean, and also the western Pacific area with southern Asia during 2015 and 2016. However, little is known about the factors affecting the transmission of ZIKV. We used Gradient Boosted Regression Tree models to investigate the effects of various potential explanatory variables on the spread of ZIKV, and used current with historical information from a range of sources to assess the risks of future ZIKV outbreaks. Our results indicated that the probability of ZIKV outbreaks increases with vapor pressure, the occurrence of Dengue virus, and population density but decreases as health expenditure, GDP, and numbers of travelers. The predictive results revealed the potential risk countries of ZIKV infection in the Asia-Pacific regions between October 2016 and January 2017. We believe that the high-risk conditions would continue in South Asia and Australia over this period. By integrating information on eco-environmental, social-economical, and ZIKV-related niche factors, this study estimated the probability for locally acquired mosquito-borne ZIKV infections in the Asia-Pacific region and improves the ability to forecast, and possibly even prevent, future outbreaks of ZIKV.",
      "with": "teng",
      "areas": "ML-SB-TM"
    },
    {
      "display": 1,
      "id": "teng2017integrative",
      "year": 2017,
      "month": 7,
      "type": "J",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=3198365481675804759",
      "cite": 21,
      "title": "An integrative analysis reveals a central role of P53 activation via MDM2 in Zika virus infection induced cell death",
      "authors": "Yue Teng, Shufeng Liu, Xiaocan Guo, Shuxia Liu, Yuan Jin, Tongtong He, Dehua Bi, Pei Zhang, Baihan Lin, Xiaoping An, Dan Feng, Zhiqiang Mi, Yigang Tong",
      "venue": "Frontiers in cellular and infection microbiology",
      "image": "teng2017integrative.png",
      "arxiv": null,
      "bibtex": "teng2017integrative.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": "teng2017integrative.pdf",
      "slides": null,
      "code": null,
      "video": null,
      "demo": null,
      "abstract": "Zika virus (ZIKV) infection is an emerging global threat that is suspected to be associated with fetal microcephaly. However, the molecular mechanisms underlying ZIKV disease pathogenesis in humans remain elusive. Here, we investigated the human protein interaction network associated with ZIKV infection using a systemic virology approach, and reconstructed the transcriptional regulatory network to analyze the mechanisms underlying ZIKV-elicited microcephaly pathogenesis. The bioinformatics findings in this study show that P53 is the hub of the genetic regulatory network for ZIKV-related and microcephaly-associated proteins. Importantly, these results imply that the ZIKV capsid protein interacts with mouse double-minute-2 homolog (MDM2), which is involved in the P53-mediated apoptosis pathway, activating the death of infected neural cells. We also found that synthetic mimics of the ZIKV capsid protein induced cell death in vitro and in vivo. This study provides important insight into the relationship between ZIKV infection and brain diseases.",
      "with": "teng",
      "areas": "ML-SB-TM-NS"
    },
    {
      "display": 1,
      "id": "lin2016odc",
      "year": 2016,
      "month": 6,
      "type": "E",
      "citelink": null,
      "cite": null,
      "title": "Ocular dominance columns in rat visual cortex: a quantitative model to analyze deprivation-induced cortical plasticity",
      "authors": "Baihan Lin, Adrian Andelin, Jaime Olavarria",
      "venue": "NeuroFutures Conference 2016",
      "image": "lin2016odc.jpg",
      "arxiv": null,
      "bibtex": "lin2016odc.txt",
      "linkname": null,
      "link": "https://alleninstitute.org/what-we-do/brain-science/events-training/neurofutures-2016/",
      "poster": "NeuroFutures_ODC.pdf",
      "pdf": null,
      "slides": null,
      "code": "https://github.com/doerlbh/OLab_patch_processor_2.0",
      "video": null,
      "demo": "https://www.youtube.com/watch?v=dGP5D3Q4aGc",
      "abstract": "What is the effect of sensory deprivation on brain development? Ocular Dominance Columns (ODCs) have been extensively used to study the mechanism of cortical plasticity, despite specific functions of ODCs elusive. Using a combination of transneuronal tracing, in situ hybridization for the immediate early gene Zif268 and electrophysiological recordings, our lab recently showed that the primary visual cortex (V1) in pigmented rats has ODCs correlated with callosal inputs from the opposite hemispheres. Using similar methods, my project aims to understand the effect of monocular deprivation (MD) on the newly discovered system of ODCs in rat visual cortex. I hypothesized that the manipulation of visual input would impact the development and recovery of eye-specific circuitry. By disrupting the visual input permanently or temporarily in early postnatal life, our lab has been able to measure the deleterious effects on map development, critical periods for these effects and potential for recovery. My project used monocular eyelid suture and enucleation to study the effect of MD on the organization of ODCs in pigmented rats. By using our experience-dependent model we expect to elucidate the principles and mechanisms underlying the development of cortical modular architecture in mammals. My result showed a clear shift in Hubel-Wiesel ocular dominance scale in central segment and clear desegregation in ODC in MD rats. I also developed a Java-based software and Matlab protocol to quantify this model. As our hypothesis is supported, our novel model may shed new lights on plasticity research, which can guide future clinical studies on the treatment and prognosis of patients suffering eye defects during early development by either innate or incidental pathological causes.",
      "with": "olavarria",
      "areas": "NS-CV"
    },
    {
      "display": 1,
      "id": "teng2015systematic",
      "year": 2015,
      "month": 5,
      "type": "J",
      "citelink": "https://scholar.google.com/scholar?oi=bibs&hl=en&cites=13711865254487012774",
      "cite": 37,
      "title": "Systematic genome-wide screening and prediction of microRNAs in EBOV during the 2014 Ebolavirus outbreak",
      "authors": "Yue Teng, Yuzhuo Wang, Xianglilan Zhang, Wenli Liu, Hang Fan, Hongwu Yao, Baihan Lin, Ping Zhu, Wenjun Yuan, Yigang Tong, Wuchun Cao",
      "venue": "Nature Scientific Reports",
      "image": "teng2015systematic.png",
      "arxiv": null,
      "bibtex": "teng2015systematic.txt",
      "linkname": null,
      "link": null,
      "poster": null,
      "pdf": "teng2015systematic.pdf",
      "slides": null,
      "code": null,
      "video": null,
      "demo": null,
      "abstract": "Recently, several thousand people have been killed by the Ebolavirus disease (EVD) in West Africa, yet no current antiviral medications and treatments are available. Systematic investigation of ebolavirus whole genomes during the 2014 outbreak may shed light on the underlying mechanisms of EVD development. Here, using the genome-wide screening in ebolavirus genome sequences, we predicted four putative viral microRNA precursors (pre-miRNAs) and seven putative mature microRNAs (miRNAs). Combing bioinformatics analysis and prediction of the potential ebolavirus miRNA target genes, we suggest that two ebolavirus coding possible miRNAs may be silence and down-regulate the target genes NFKBIE and RIPK1, which are the central mediator of the pathways related with host cell defense mechanism. Additionally, the ebolavirus exploits the miRNAs to inhibit the NF-kB and TNF factors to evade the host defense mechanisms that limit replication by killing infected cells, or to conversely trigger apoptosis as a mechanism to increase virus spreading. This is the first study to use the genome-wide scanning to predict microRNAs in the 2014 outbreak EVD and then to apply systematic bioinformatics to analyze their target genes. We revealed a potential mechanism of miRNAs in ebolavirus infection and possible therapeutic targets for Ebola viral infection treatment.",
      "with": "teng",
      "areas": "ML-SB-TM"
    }
  ],
  "Sheet2": [
    {
      "from": 2017,
      "to": "now",
      "at": "my own time",
      "with": "mostly single-authored",
      "pubs": null,
      "on": "NS-ML-CV-IT-GT-SB-HCI-SP",
      "name": "self"
    },
    {
      "from": 2021,
      "to": "now",
      "at": "Google",
      "with": "X, the Moonshot Factory",
      "pubs": null,
      "on": "NS-ML-TM-CV-SP",
      "name": "google"
    },
    {
      "from": 2017,
      "to": "now",
      "at": "IBM",
      "with": "CompNeuro & AI Foundations Groups",
      "pubs": null,
      "on": "NS-ML-CV-GT-TM",
      "name": "ibm"
    },
    {
      "from": 2021,
      "to": 2021,
      "at": "Amazon",
      "with": "CTPS, ML Science",
      "pubs": null,
      "on": "ML",
      "name": "amazon"
    },
    {
      "from": 2017,
      "to": 2017,
      "at": "Microsoft",
      "with": "EPIC & HCI Groups",
      "pubs": null,
      "on": "NS-CV-HCI",
      "name": "microsoft"
    },
    {
      "from": 2018,
      "to": "now",
      "at": "Columbia",
      "with": "Visual Inference Lab (PI: Kriegeskorte)",
      "pubs": null,
      "on": "NS-ML-CV-GT",
      "name": "kriegeskorte"
    },
    {
      "from": 2018,
      "to": 2019,
      "at": null,
      "with": "Neuro Theory Center (PI: Qian)",
      "pubs": null,
      "on": "NS-ML-CV-GT-IT",
      "name": "qian"
    },
    {
      "from": 2018,
      "to": 2018,
      "at": null,
      "with": "Math Genomics Lab of DSB (PI: Rabadan)",
      "pubs": null,
      "on": "SB-ML-GT",
      "name": "rabadan"
    },
    {
      "from": 2017,
      "to": 2017,
      "at": null,
      "with": "Comp Bio Lab of CS (PI: Pe’er)",
      "pubs": null,
      "on": "SB-ML-TM",
      "name": "peer"
    },
    {
      "from": 2017,
      "to": 2017,
      "at": "UW",
      "with": "UbiComp Lab of CSE & EE (PI: Patel)",
      "pubs": null,
      "on": "HCI-ML-TM",
      "name": "patel"
    },
    {
      "from": 2015,
      "to": 2017,
      "at": null,
      "with": "Institute for Protein Design (PI: Baker)",
      "pubs": null,
      "on": "SB",
      "name": "baker"
    },
    {
      "from": 2016,
      "to": 2016,
      "at": null,
      "with": "Biophysics Lab of Applied Math (PI: Qian)",
      "pubs": null,
      "on": "SB-AM",
      "name": "uwqian"
    },
    {
      "from": 2014,
      "to": 2016,
      "at": null,
      "with": "Vision Neuroscience Lab (PI: Olavarria)",
      "pubs": null,
      "on": "NS-CV",
      "name": "olavarria"
    },
    {
      "from": 2014,
      "to": 2017,
      "at": "BIME",
      "with": "State Key Lab of Pathogen & Biosecurity",
      "pubs": null,
      "on": "NS-SB-AM-TM",
      "name": "teng"
    },
    {
      "from": 2013,
      "to": 2013,
      "at": "BGI",
      "with": "Personalized Genome Group",
      "pubs": null,
      "on": "SB-TM",
      "name": "bgi"
    }
  ]
}
